[
{"type": "MicroBachelors", "name": "Elements of Data Science", "creator": "Rice University", "program": ["The basic objects of linear algebra – how to compute with them, how they fit together theoretically, and how they can be used to solve real problems", "Data models and systems for processing signals, images, and big data sets", "Practical implementation of signal processing and machine learning algorithms on data from the real world", "Ability to navigate the data science process as an expert instead of relying on trial and error with black box methods"], "overview": ["Across industries, data science is becoming an ever-increasing necessity for organizations to be successful. Collecting, analyzing and strategically acting on big data sets based on key signals is critical, and data scientists are the ones leading the way and informing decision makers.", "This online Intermediate-level program is designed for working adults looking to pursue a career as a data scientist and roles focused on machine learning. Whether you already work with data in your current role or are interested in the larger field of computer science, this program is designed to build a solid foundation in underlying algorithms and principles of the tools used. This Foundational Data Science MicroBachelors program consists of two courses that develop key mathematical skills and explores terminology, models, and algorithms found in signal processing and machine learning.", "With the successful completion of this program, passing all courses with a 70% or better via the verified (paid) track, you’ll not only receive a certificate highlighting your achievement, but also have the option to collect real college credit (included in the price!) that you can count towards a pursuit of a bachelor’s degree.", "Prerequisite - In addition to the math skills developed in the Linear Algebra course, calculus (which is not a part of this program) is required."], "duration": "6 months", "study hours": "6 - 8 hours per week", "courses": ["The Math of Data Science: Linear Algebra", "Discrete Time Signals and Systems", "Signals, Systems, and Learning"]},
{"type": "Professional Certificate", "name": "IBM Data Science", "creator": "IBM", "program": ["Apply various Data Science and Machine Learning skills, techniques, and tools to complete a project and publish a report.", "Practice with various tools used by Data Scientists and become experienced in using some of them like Jupyter notebooks.", "Master the key steps involved in tackling a data science problem and learn to follow a methodology to think and work like a Data Scientist.", "Write SQL to query databases and explore relational database concepts.", "Understand Python and practice Python programming using Jupyter.", "Import and clean data sets, analyze data, build and evaluate data models and pipelines using Python.", "Utilize several data visualization tools, techniques and libraries in Python to present data visually.", "Understand and apply various supervised and unsupervised Machine Learning models and algorithms to address real world challenges using Python."], "overview": ["Data science  and machine learning skills continue to be in highest demand across industries, and the need for data practitioners is booming. Upon completing this Professional Certificate program, you will be armed with the skills and experience you need to start your career in data science and machine learning.", "Through hands-on assignments and high-quality instruction, you will build a portfolio using real data science tools and real-world problems and data sets. The curriculum will cover a wide range of data science topics including: open source tools and libraries, methodologies, Python, databases, SQL, data visualization, data analysis, and machine learning. There is no requirement for prior computer science or programming knowledge in order to take this program.", "Anyone with some computer skills and a passion for self-learning can succeed as we begin small and build up to more complex problems and topics.", "With the tremendous need for data science and data analyst professionals in the market today, this program will jumpstart your path in data science and prepare you with a portfolio of data science deliverables to give you the confidence to take the plunge and start your data science career."], "duration": "1 year 1 month", "study hours": "3 - 5 hours per week", "courses": ["Introduction to Data Science", "Data Science Tools", "The Data Science Method", "SQL for Data Science", "Python Basics for Data Science", "Analyzing Data with Python", "Visualizing Data with Python", "Machine Learning with Python: A Practical Introduction", "Data Science and Machine Learning Capstone Project"]},
{"type": "Professional Certificate", "name": "Python Data Science", "creator": "IBM", "program": ["Understand Python language basics and how they apply to data science.", "Practice iterative data science using Jupyter notebooks on IBM Cloud.", "Analyze data using Python libraries like pandas and numpy.", "Create stunning data visualizations with matplotlib, folium, and seaborn.", "Build machine learning models using scipy and scikitlearn.", "Demonstrate proficiency in solving real life data science problems."], "overview": ["Data is at the heart of our digital economy and data science has been ranked as the hottest profession of the 21st century. Whether you are new to the job market or already in the workforce and looking to upskill yourself, this five course Data Science with Python Professional Certificate program is aimed at preparing you for a career in data science and machine learning. No prior computer programming experience required!", "You will start by learning Python, the most popular language for data science. You will then develop skills for data analysis and data visualization and also get a practical introduction in machine learning. Finally, you will apply and demonstrate your knowledge of data science and machine learning with a capstone project involving a real life business problem.", "This program is taught by experts and focused  on hands-on learning and job readiness. As such you will work with real datasets and will be given no-charge access to tools like Jupyter notebooks in the IBM Cloud. You will utilize popular Python toolkits and libraries such as pandas, numpy, matplotlib, seaborn, folium, scipy, scikitlearn, and more.", "Start developing data and analytical skills today and launch your career in data science!"], "duration": "7 months", "study hours": "3 - 5 hours per week", "courses": ["Python Basics for Data Science", "Analyzing Data with Python", "Visualizing Data with Python", "Machine Learning with Python: A Practical Introduction", "Data Science and Machine Learning Capstone Project"]},
{"type": "Professional Certificate", "name": "Data Science Foundations", "creator": "IBM", "program": ["Learn about various tools used by Data Scientists and become experienced in using some of them like Jupyter notebooks.", "Develop an understanding of the key steps involved in tackling a data science problem.", "Learn to follow a methodology to think and work like a Data Scientist.", "Write SQL to query databases and explore relational database concepts.", "Complete hands-on labs and projects to apply their newly acquired skills and knowledge."], "overview": ["Data science and machine learning skills continue to be in highest demand across industries, and the need for data practitioners is booming. Upon completing this Professional Certificate program, you will be armed with the basics to jump start your career in data science and machine learning.", "It is a myth that to become a data scientist you need a Ph.D. This Professional Certificate is suitable for anyone who has some computer skills and a passion for self-learning. No prior computer science or programming knowledge is necessary. Anyone with some computer skills and a passion for self-learning can succeed as we start small and build up to more complex problems and topics.", "When you are ready you can build up to more complex topics in our full 9-course Data Science Professional Certificate program which covers a wide array of data science topics including: open source tools and libraries, methodologies, Python, databases, SQL, data visualization, data analysis, machine learning, and a capstone project.", "With the tremendous need for data science and data analyst professionals in the market today, this program will kick-start your path in data science and arm you with the fundamentals of Data Science so that you have the confidence to take the plunge and start your data science career today."], "duration": "6 months", "study hours": "3 - 6 hours per week", "courses": ["Introduction to Data Science", "Data Science Tools", "The Data Science Method", "SQL for Data Science"]},
{"type": "Professional Certificate", "name": "Data Science Foundations", "creator": "IBM", "program": ["Learn about various tools used by Data Scientists and become experienced in using some of them like Jupyter notebooks.", "Develop an understanding of the key steps involved in tackling a data science problem.", "Learn to follow a methodology to think and work like a Data Scientist.", "Write SQL to query databases and explore relational database concepts.", "Complete hands-on labs and projects to apply their newly acquired skills and knowledge."], "overview": ["Data science and machine learning skills continue to be in highest demand across industries, and the need for data practitioners is booming. Upon completing this Professional Certificate program, you will be armed with the basics to jump start your career in data science and machine learning.", "It is a myth that to become a data scientist you need a Ph.D. This Professional Certificate is suitable for anyone who has some computer skills and a passion for self-learning. No prior computer science or programming knowledge is necessary. Anyone with some computer skills and a passion for self-learning can succeed as we start small and build up to more complex problems and topics.", "When you are ready you can build up to more complex topics in our full 9-course Data Science Professional Certificate program which covers a wide array of data science topics including: open source tools and libraries, methodologies, Python, databases, SQL, data visualization, data analysis, machine learning, and a capstone project.", "With the tremendous need for data science and data analyst professionals in the market today, this program will kick-start your path in data science and arm you with the fundamentals of Data Science so that you have the confidence to take the plunge and start your data science career today."], "duration": "6 months", "study hours": "3 - 6 hours per week", "courses": ["Introduction to Data Science", "Data Science Tools", "The Data Science Method", "SQL for Data Science"]},
{"type": "Professional Certificate", "name": "Data  Science", "creator": "Harvard University", "program": ["Fundamental R programming skills", "Statistical concepts such as probability, inference, and modeling and how to apply them in practice", "Gain experience with the tidyverse, including data visualization with ggplot2 and data wrangling with dplyr", "Become familiar with essential tools for practicing data scientists such as Unix/Linux, git and GitHub, and RStudio", "Implement machine learning algorithms", "In-depth knowledge of fundamental data science concepts through motivating real-world case studies"], "overview": ["The demand for skilled data science practitioners in industry, academia, and government is rapidly growing. The HarvardX Data Science program prepares you with the necessary knowledge base and useful skills to tackle real-world data analysis challenges. The program covers concepts such as probability, inference, regression, and machine learning and helps you develop an essential skill set that includes R programming, data wrangling with dplyr, data visualization with ggplot2, file organization with Unix/Linux, version control with git and GitHub, and reproducible document preparation with RStudio.", "In each course, we use motivating case studies, ask specific questions, and learn by answering these through data analysis. Case studies include: Trends in World Health and Economics, US Crime Rates, The Financial Crisis of 2007-2008, Election Forecasting, Building a Baseball Team (inspired by Moneyball), and Movie Recommendation Systems.", "Throughout the program, we will be using the R software environment. You will learn R, statistical concepts, and data analysis techniques simultaneously. We believe that you can better retain R knowledge when you learn how to solve a specific problem."], "duration": "1 year 5 months", "study hours": "2 - 3 hours per week", "courses": ["Data Science: R Basics", "Data Science: Visualization", "Data Science: Probability", "Data Science: Inference and Modeling", "Data Science: Productivity Tools", "Data Science: Wrangling", "Data Science: Linear Regression", "Data Science: Machine Learning", "Data Science: Capstone"]},
{"type": "MicroMasters", "name": "Data Science", "creator": "The University of California, San Diego", "program": ["How to load and clean real-world data", "How to make reliable statistical inferences from noisy data", "How to use machine learning to learn models for data", "How to visualize complex data", "How to use Apache Spark to analyze data that does not fit within the memory of a single computer"], "overview": ["Excel in Data Science, one of the hottest fields in tech today. Learn how to gain new insights from big data by asking the right questions, manipulating data sets and visualizing your findings in compelling ways. ", "In this MicroMasters program, you will develop a well-rounded understanding of the mathematical and computational tools that form the basis of data science and how to use those tools to make data-driven business recommendations. ", "This MicroMasters program encompasses two sides of data science learning: the mathematical and the applied. ", "Mathematical courses cover probability, statistics, and machine learning. The applied courses cover the use of specific toolkit and languages such as Python, Numpy, Matplotlib, pandas and Scipy, the Jupyter notebook environment and Apache Spark to delve into real world data.", "You will learn how to collect, clean and analyse big data using popular open source software will allow you to perform large-scale data analysis and present your findings in a convincing, visual way. When combined with expertise in a particular type of business, it will make you a highly desirable employee."], "duration": "10 months", "study hours": "9 - 11 hours per week", "courses": ["Python for Data Science", "Probability and Statistics in Data Science using Python", "Machine Learning Fundamentals", "Big Data Analytics Using Spark"]},
{"type": "Professional Certificate", "name": "Foundations of Data Science", "creator": "University of California, Berkeley", "program": ["How to interpret and communicate data and results using a vast array of real-world examples from different domains", "How to make predictions using machine learning and statistical methods", "Computational thinking and skills, including the Python programming language for analyzing and visualizing data", "How to think critically about data and draw robust conclusions based on incomplete information"], "overview": ["As the demand for data science skills rises around the world, this Professional Certificate by BerkeleyX will teach you how to combine data with Python programming skills to ask questions and explore problems that you may encounter in a future job, in any field of study, and even in everyday life. This course will give you a new lens to explore the issues and problems that you care about. ", "Among others, Berkeley’s online data science program has been endorsed by  Google’s Vice President of Education and Microsoft’s Corporate Vice President of Cloud AI. The program is based on Data 8, UC Berkeley’s fastest-growing class, taken by more than 3300 students each year as they start their data science journey. Data 8 is recognized amongst institutions as the preeminent introductory data science course has helped place UC Berkeley at the forefront of democratizing data science for all. Top-ranked universities from around the world, such as Yale, Cornell, and NYU, have followed Berkeley’s lead by creating their own versions of UC Berkeley’s groundbreaking data science course. Through this professional certificate, students all over the world can now take UC Berkeley’s most popular course.", "This course is accessible for students who have not previously taken statistics or computer science courses. No prior programming experience is assumed or necessary. Through instructor guided videos and labs, you will learn about topics starting from fundamental data science concepts to machine learning methods.", "This program will help you become a data scientist by teaching you how to analyze a diverse set of real data sets including economic data, geographic data, and public health data. Typically, the information will be incomplete and there will be some uncertainty involved. You will learn how to conduct inference, which will help you quantify uncertainty and measure the accuracy of your estimates. Finally, you will put all of your knowledge together and learn about prediction using machine learning.\r\nWe all have to be able to think critically and make decisions based on data. Thus, the program aims to make data science accessible to everyone. The program focuses on a set of core concepts and techniques that have broad applicability. Unlike “bootcamps” for programmers, this program presents data science as a way of thinking, in which interpretation and communication are as important as computation and statistical methods.", "You don’t have to download any software – a browser is all you need. Open up a window and prepare to have some fun."], "duration": "4 months", "study hours": "4 - 6 hours per week", "courses": ["Data Science: Computational Thinking with Python", "Data Science: Inferential Thinking through Simulations", "Data Science: Machine Learning and Predictions"]},
{"type": "Professional Certificate", "name": "Ciencia de Datos", "creator": "Tecnológico de Monterrey", "program": ["Comprender y analizar los diferentes tipos de sistemas de información y datos usados en las organizaciones.", "Aplicar metodologías para la analítica de datos y ciencia de datos para apoyar la inteligencia de negocios en la organización.", "Proponer soluciones apoyadas en los datos, adecuadas a las necesidades específicas de la organización para la mejor utilización y optimización de los recursos de la empresa.", "Consolidar las habilidades de análisis de información; manejo de bases de datos y visualización de datos y storytelling aplicando técnicas de vanguardia para desarrollar una propuesta de inteligencia de negocios para una organización."], "overview": ["Cada vez es más común escuchar sobre el big data y el Data Science o ciencia de datos y cómo estos son necesarios para llevar al éxito a las organizaciones. ", "El análisis de datos y el big data están tomando cada vez más relevancia en las organizaciones hoy en día. De acuerdo al reporte de IBM: ", ", se requiere de expertos en los datos en todas las áreas de las organizaciones para mejorar los procesos estratégicos, incrementar la eficiencia operativa, reducir costos e incrementar la productividad de las empresas. Los datos, además, ayudan a identificar de forma correcta los Indicadores clave del Negocio (KPIs Key Performance Indicators) y a la par, comprender su comportamiento para detectar situaciones de riesgo.", "La inteligencia de negocios es realmente importante en la actualidad, las organizaciones manejan una gran cantidad de datos, por lo cual es necesario poder procesar e interpretar esta información, para que así la organización pueda tomar decisiones informadas. ", "Este programa de Certificación Profesional te permitirá conocer cómo la ciencia de datos aplicados permitirá la toma de mejores decisiones para una organización. Conviértete en un científico de datos con este programa en línea, compuesto por tres cursos y desarróllalo para que avances en tu carrera profesional. "], "duration": "3 months", "study hours": "3 - 5 hours per week", "courses": ["Introducción a la Ciencia de Datos y el Big Data", "Herramientas para el Análisis de Big Data", "Visualización de Datos y Storytelling"]},
{"type": "Professional Certificate", "name": "Fundamentos de Ciencia de Datos con R", "creator": "Universidades Anáhuac", "program": ["Dominio del lenguaje R para procesar, analizar y visualizar información", "Aprenderás diferentes técnicas que te permitirán analizar información de manera rápida y visual", "Interpretar adecuadamente y brindar en el contexto correcto las soluciones obtenidas con las herramientas de análisis", "Mejores prácticas para la aplicación de estas técnicas en la toma de decisiones empresariales"], "overview": ["La ciencia de datos está transformando la manera en cómo las organizaciones trabajan con sus datos, ya que permite generar información más precisa, confiable, en tiempo real y que sustenta además de una toma de decisiones histórica, una estrategia proactiva. Con estas herramientas, las empresas modernas están automatizando procesos capaces de tomar decisiones autónomas lo que se convierte en una ventaja competitiva en el mercado actual.", "En este curso aprenderás no solo como funcionan las herramientas de la ciencia de datos (Data Science) sino aplicarlas de forma sencilla con uno de los ambientes de análisis mayormente aceptados como lo es “R”. El lenguaje R es un lenguaje de programación comunmente usado.", "En este programa de Certificación Profesional desarrollarás las actividades necesarias para aplicar la ciencia de datos y también aprenderás a través de casos prácticos cómo aprovechar mejor estas herramientas para el proceso de toma de decisiones.", "La metodología de este programa está pensanda para que sin importar tu nivel de conocimiento en el tema puedas alcanzar el nivel necesario para el análisis de datos en cada uno de los cursos en línea que lo componen.", "Todas las herramientas del programa, compuesto por 3 cursos online, son de uso libre y corren en todas las plataformas de cómputo."], "duration": "3 months", "study hours": "5 - 9 hours per week", "courses": ["Introducción a R", "Análisis de datos empresariales con R", "Aplicaciones de ciencias de datos en los negocios actuales"]},
{"type": "MicroMasters", "name": "Statistics and Data Science", "creator": "Massachusetts Institute of Technology", "program": ["Master the foundations of data science, statistics, and machine learning", "Analyze big data and make data-driven predictions through probabilistic modeling and statistical inference; identify and deploy appropriate modeling and methodologies in order to extract meaningful information for decision making", "Develop and build machine learning algorithms to extract meaningful information from seemingly unstructured data; learn popular unsupervised learning methods, including clustering methodologies and supervised methods such as deep neural networks", "Finishing this MicroMasters program will prepare you for job titles such as: Data Scientist, Data Analyst, Business Intelligence Analyst, Systems Analyst, Data Engineer"], "overview": ["Demand for professionals skilled in data, analytics, and machine learning is exploding. The ", " reports that demand for data science skills will drive a 27.9 percent rise in employment in the field through 2026. Data scientists bring value to organizations across industries because they are able to solve complex challenges with data and drive important decision-making processes. Not only is there a huge demand, but there is a significant shortage of qualified data scientists with 39% of the most rigorous data science positions requiring a degree higher than a bachelor’s.", "This MicroMasters program in Statistics and Data Science is comprised of four online courses and a virtually proctored exam that will provide you with the foundational knowledge essential to understanding the methods and tools used in data science, and hands-on training in data analysis and machine learning. You will dive into the fundamentals of probability and statistics, as well as learn, implement, and experiment with data analysis techniques and machine learning algorithms. This program will prepare you to become an informed and effective practitioner of data science who adds value to an organization. The program certificate can be applied, for admitted students, towards a PhD in Social and Engineering Systems (SES) through the MIT Institute for Data, Systems, and Society (IDSS) or may accelerate your path towards a Master’s degree at other universities around the world.", "Anyone can enroll in this MicroMasters program. It is designed for learners that want to acquire sophisticated and rigorous training in data science without leaving their day job but without compromising quality. There is no application process but college-level calculus and comfort with mathematical reasoning and Python programming are highly recommended if you want to excel. All the courses are taught by MIT faculty at a similar pace and level of rigor as an on-campus course at MIT.   This program brings MIT’s rigorous, high-quality curricula and hands-on learning approach to learners around the world – at scale. ", "For more detail on this program and credit pathways, please visit "], "duration": "1 year 2 months", "study hours": "10 - 14 hours per week", "courses": ["Probability - The Science of Uncertainty and Data", "Fundamentals of Statistics", "Machine Learning with Python: from Linear Models to Deep Learning", "Capstone Exam in Statistics and Data Science"]}
]